<a href="https://colab.research.google.com/github/Olamyyde/test-colab/blob/master/141_150_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas

### Table of contents:
* [Import biblioteki](#0)
* [Exercise 141](#1)
* [Exercise 142](#2)
* [Exercise 143](#3)
* [Exercise 144](#4)
* [Exercise 145](#5)
* [Exercise 146](#6)
* [Exercise 147](#7)
* [Exercise 148](#8)
* [Exercise 149](#9)
* [Exercise 150](#10)

### <a name='0'></a> Import of libraries

In [1]:
import numpy as np
import pandas as pd

np.random.seed(42)
np.__version__

'1.18.5'

### <a name='1'></a> Exercise 141
Two _Series_ objects are given:
```
s1 = pd.Series(np.random.rand(20))
s2 = pd.Series(np.random.randn(20))
```
Combine these two objects into one _DataFrame_ object (as two columns) and assign to _df_. Name the columns _col1_ and _col2_ respectively.

In [5]:
# enter solution here
s1 = pd.Series(np.random.rand(20))
s2 = pd.Series(np.random.randn(20))

df = pd.concat([s1, s2], axis=1)
df.columns = ['col1', 'col2']
df

        col1      col2
0   0.518791  1.142823
1   0.703019  0.751933
2   0.363630  0.791032
3   0.971782 -0.909387
4   0.962447  1.402794
5   0.251782 -1.401851
6   0.497249  0.586857
7   0.300878  2.190456
8   0.284840 -0.990536
9   0.036887 -0.566298
10  0.609564  0.099651
11  0.502679 -0.503476
12  0.051479 -1.550663
13  0.278646  0.068563
14  0.908266 -1.062304
15  0.239562  0.473592
16  0.144895 -0.919424
17  0.489453  1.549934
18  0.985650 -0.783253
19  0.242055 -0.322062

### <a name='2'></a> Exercise 142
Extract rows from the _df_ object for which the value in the _col2_ column is between 0.0 and 1.0 (inclusive).

In [6]:
# enter solution here
df[df['col2'].between(0.0, 1.0)]

        col1      col2
1   0.703019  0.751933
2   0.363630  0.791032
6   0.497249  0.586857
10  0.609564  0.099651
13  0.278646  0.068563
15  0.239562  0.473592

### <a name='3'></a> Exercise 143
Assign a new column named _col3_, which will have a value of 1 when the value in the column _col2_ is non-negative and -1 opposite.

In [ ]:
# enter solution here

### <a name='4'></a> Exercise 144

Assign a new column _col4_, which will truncate the values from the column _col2_ to the range $ [- 1.0, 1.0] $.
In other words, for values below -1.0, leave -1.0, for values above 1.0, leave 1.0.

In [ ]:
# enter solution here

### <a name='5'></a> Exercise 145
Find the top 5 values for the _col2_ column.

In [ ]:
# enter solution here

Find the 5 lowest values for the _col2_ column.

In [ ]:
# enter solution here

### <a name='6'></a> Exercise 146
Calculate the cumulative sum for each column.

__Tip:__ Use the _pd.DataFrame.cumsum()_ method.

In [ ]:
# enter solution here

### <a name='7'></a> Exercise 147
Calculate the median for the _col2_ variable (or 0.5 quantile).

In [ ]:
# enter solution here

### <a name='8'></a> Exercise 148
Extract rows for which the variable _col2_ takes values greater than 0.0.

In [ ]:
# enter solution here

### <a name='9'></a> Exercise 149
Extract first 5 rows of the _df_ object and convert it to a dictionary.

In [ ]:
# enter solution here

### <a name='10'></a> Exercise 150
Extract the first 5 rows of the _df_ object, convert it to Markdown format, and assign it to the _df_markdown_ variable.

In [ ]:
# enter solution here

Print the contents of the _df_markdown_ variable to the console.

In [ ]:
# enter solution here

Copy the result of running the above cell and paste below:

|    |     col1 |      col2 |   col3 |      col4 |
|---:|---------:|----------:|-------:|----------:|
|  0 | 0.292145 |  0.822545 |      1 |  0.822545 |
|  1 | 0.366362 | -1.22084  |     -1 | -1        |
|  2 | 0.45607  |  0.208864 |      1 |  0.208864 |
|  3 | 0.785176 | -1.95967  |     -1 | -1        |
|  4 | 0.199674 | -1.32819  |     -1 | -1        |